language = {
    'uk': {
        'відкрити налаштування': 'Відкрити налаштування', "запрошує гравців": "Запрошує гравців",
        'виконує пошук випадкового суперника': 'Виконує пошук випадкового суперника',
        'ви тепер знаходитесь в очікуванні': 'Ви тепер знаходитесь в очікуванні',
        'завантаження катки...': 'Завантаження катки...', 'катка завантажена!': 'Катка завантажена!',
        'ви\nчовни:': 'Ви\nЧовни:', 'опонент\nчовни:': 'Опонент\nЧовни:',
        'ви можете спілкуватись з опонетом під час гри\nдля спілкування використовуйте -msg/-п': 'Ви можете спілкуватись з опонетом під час гри\nДля спілкування використовуйте -msg/-п',
        'вогонь, сер': 'Вогонь, Сер', 'першим атакує': 'Першим атакує', 'ви досі очікуєте': 'Ви досі очікуєте',
        'навіщо? ви вже в грі': 'Навіщо? Ви вже в грі',
        'такий гравець вже в грі\nбудь ласка змініть ігрове ім`я': 'Такий гравець вже в грі\nБудь ласка змініть ігрове ім`я',
        'такий гравець вже очікує\nбудь ласка змініть ігрове ім1я': 'Такий гравець вже очікує\nБудь ласка змініть ігрове ім`я',
        'виходить з гри': 'Вийти з гри', "катка інфо": "Інформація про ігри",
        'ваш опонент покинув гру\nви автоматично покинули гру': 'Ваш опонент покинув гру\nВи автоматично покинули гру',
        'ви покинули гру': 'Ви покинули гру', 'ви перестали очікувати гру': 'Ви перестали очікувати гру',
        'ви не очікуєте гру': 'Ви не очікуєте гру',
        'написати повідомлення супротивнику': 'Написати повідомлення супротивнику', 'ви не в грі': 'Ви не в грі',
        'запустити залп!': 'Запустити залп!', 'введені неправильні елементи': 'Введені неправильні елементи',
        'неправильна кількість елементів': 'Неправильна кількість елементів', 'ще не ваша черга': 'Ще не ваша черга',
        'вогонь туди було проведено раніше.': 'Вогонь туди було проведено раніше.',
        'ви завершили гру': 'Ви завершили гру',
        'ваша черга': 'Ваша черга', 'не знайдено': 'не знайдено',
        'я бот Sea War вітаю вас в пп': 'Я, ігровий Бот Sea War, вітаю вас в Приватних Повідомленнях',
        'бот Sea War від NightBird78 готовий до битв': 'Бот **Sea War** від **NightBird78** готовий до битв',
        'тепер можна грати': 'Тепер можна грати',
        'бот привітає вас в пп для подальшої гри': 'Бот привітає вас в Приватних Повідомленнях для подальшої гри',
        "це дискорд адаптація класичної настільно паперової гри в морський бій": "Це дискорд-адаптація класичної настільно-паперової гри в Морський Бій",
        "якщо вам подобається концепція гри то поділіться ботом з друзями, мені як розробнику буде приємно": "Якщо вам подобається концепція гри, то поділіться ботом з друзями, мені як розробнику буде приємно",
        "має бути числом": "має бути числом",
        "якщо з'являться пропозиції, пишіть -offer <текст>": "Якщо з'являться пропозиції, пишіть -offer <текст>",
        "має бути в межах від 30 до 300": "має бути в межах від 30 до 300",
        "автокік": 'Протягом _ секунд не було знайдено жодного опонента\nВи були автоматично вигнані з очікування',
        "пропозиція": "Написати пропозицію для розробника", "показує рейтинг гравців": "Показує рейтинг гравців",
        "показує статистику гравця": "Показує статистику гравця", 'зіграно ігор': 'зіграно ігор',
        "виграно ігор": "виграно ігор", "програно ігор": "програно ігор", "знищено кораблів": "знищено кораблів",
        "поділитися грою": "Поділитися грою", "промах": "Промах", "пряме попадання!": "Пряме попадання!",
        "убив!": "Убив!", "ви неможете використовувати це тут": "Ви неможете використовувати це тут",
        'список гравців': 'Список гравців','показує список доступних команд':'Показує список доступних команд',"опис непотрібний":"Опис непотрібний",
        "запрошує гравця на гру":"Запрошує гравця на гру", "-invite <SeawarID> що б запросити пограти":"-invite <SeawarID> що б запросити пограти",
        "запрошує вас пограти":"запрошує вас пограти","ви запросили":"Ви запросили","ви не можете запросити себе":"Ви не можете запросити себе",
        "введений некоректний SeawarID":"Введений некоректний **SeawarID**"
    },
    'en': {
        "введений некоректний SeawarID":"Invalid **SeawarID** entered",
        "запрошує вас пограти":"invites you to battle","ви запросили":"You invite","ви не можете запросити себе":"You can`t invite yourself",
        "запрошує гравця на гру":"Invite the player to battle","-invite <SeawarID> що б запросити пограти":"-invite <SeawarID> for invite to battle",
        'відкрити налаштування': 'Open the settings', "запрошує гравців": "inviting players",
        'виконує пошук випадкового суперника': 'Execute searching for a random opponent',
        'ви тепер знаходитесь в очікуванні': 'You are now waiting', 'завантаження катки...': 'Loading the Match...',
        'катка завантажена!': 'Match loaded!', 'ви\nчовни:': 'You\nShips:', 'опонент\nчовни:': 'Opponent\nShips:',
        'ви можете спілкуватись з опонетом під час гри\nдля спілкування використовуйте -msg/-п': 'You can communicate with an opnet while playing\nUse -msg to communicate',
        'вогонь, сер': 'Fire, sir', 'першим атакує': 'The first attacks', 'ви досі очікуєте': 'You still waiting',
        'навіщо? Ви вже в грі': 'Why? You are already in the game',
        "такий гравець вже в грі\nбудь ласка змініть ігрове ім'я": 'Such a player is already in the game\nPlease change the player name',
        "такий гравець вже очікує\nбудь ласка змініть ігрове ім'я": 'Such a player is already expecting\nPlease change the player name',
        'виходить з гри': 'Comes out of the game',
        'ваш опонент покинув гру\nви автоматично покинули гру': 'Your opponent has left the game\nYou automatically left the game',
        'ви покинули гру': 'You left the game', 'ви перестали очікувати гру': 'You stopped waiting for a game',
        'ви не очікуєте гру': "You don't expect the game",
        'написати повідомлення супротивнику': 'Write a message to the opponent', 'ви не в грі': 'You are not in a game',
        'запустити залп!': 'Run the volley!', 'введені неправильні елементи': 'Incorrect items are entered',
        'неправильна кількість елементів': 'Incorrect number of items', 'ще не ваша черга': 'Not your turn yet',
        'вогонь туди було проведено раніше.': 'The fire was carried out earlier.',
        'ви завершили гру': 'You have completed the game', 'ваша черга': 'Your turn', 'не знайдено': 'not found',
        'я бот Sea War вітаю вас в пп': 'I, Game Bot Sea War, welcome you to Private Messages',
        'бот Sea War від NightBird78 готовий до битв': 'Bot **Sea War** by **NightBird78** is ready for battles',
        'тепер можна грати': 'Now you can play', "катка інфо": "Information about games",
        'бот привітає вас в пп для подальшої гри': 'Bot will greet you in Private Messages for further play',
        "це дискорд адаптація класичної настільно паперової гри в морський бій": "This is a Discord adaptation of the classic board-paper game Sea Battle",
        "якщо вам подобається концепція гри то поділіться ботом з друзями, мені як розробнику буде приємно": "If you like the concept of the game, share the bot with your friends, I will be happy as a developer",
        "має бути числом": "must be a number",
        "якщо з'являться пропозиції, пишіть -offer <текст>": "If offers appear, write -offer <text>",
        "має бути в межах від 30 до 300": "should be between 30 and 300",
        "автокік": 'No one opponent was found within _ seconds\nYou were kicked from waiting',
        "пропозиція": 'Send a suggesion for the developer', "показує рейтинг гравців": "Shows player rating",
        'зіграно ігор': 'games played',
        "показує статистику гравця": "Shows player stats", "виграно ігор": "games won", "програно ігор": "lost games",
        "знищено кораблів": "destroyed ships", "поділитися грою": "Share game", "промах": "Miss",
        "пряме попадання!": "Direct hit!", "убив!": "Killed!",
        "ви неможете використовувати це тут": "You can't use it here", 'список гравців': 'Player list','показує список доступних команд':'Shows a list of available commands', "опис непотрібний":"Description is unnecessary"}
    #    'ru': {...}
}

# from googletrans import Translator

# translator = Translator()

# aa = ['Відкрити налаштування', 'Виконує пошук випадкового суперника', 'ви тепер знаходитесь в очікуванні',
#       "Завантаження катки...", "Катка завантажена!" "Ви\nЧовни:", "Опонент\nЧовни:",
#       "Ви можете спілкуватись з опонетом під час гри\nДля спілкування використовуйте -msg/-п", "Вогонь, Сер",
#       "Першим атакує", "ви досі очікуєте", "Навіщо? Ви вже в грі",
#       "такий гравець вже в грі\nБудь ласка змініть ігрове ім'я",
#       "такий гравець вже очікує\nБудь ласка змініть ігрове ім'я", "Виходить з гри",
#       "ваш опонент покинув гру\nви автоматично покинули гру", "ви покинули гру", "ви перестали очікувати гру",
#       "ви не очікуєте гру", "Написати повідомлення супротивнику", "ви не в грі", 'Запустити залп!',
#       'Введені неправильні елементи', 'Неправильна кількість елементів', "Ще не ваша черга",
#       'Вогонь туди було проведено раніше.', 'Ви завершили гру', "Ваша черга", "не знайдено"]
# bbb = []
# for a in aa:
#    bbb.append(translator.translate(a.lower(), dest='ru', src='uk').text)
#    print(len(bbb), '/', len(aa))

# finnal = dict(zip(aa, bbb))
# print(finnal)
